In [6]:
import numpy as np
import pandas as pd

In [7]:
 data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}

In [8]:
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [9]:
one = pd.DataFrame(data_one)

In [10]:
two = pd.DataFrame(data_two)

In [11]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [12]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [13]:
pd.concat([one, two], axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [14]:
pd.concat([one, two], axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [15]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [16]:
# переименование колонок для валидного объединения строк
two.columns = one.columns
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [17]:
pd.concat([one, two], axis=0)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [18]:
# сохраняем предыдущий dataFrame в переменную и изменяем ему индекс
mydf = pd.concat([one,two], axis=0)
mydf.index = range(len(mydf))
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

# Соединение (Merge)

In [19]:
# создаем два dataFrames
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [20]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [21]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [22]:
pd.merge(registrations, logins, how='inner', on='name')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [23]:
pd.merge(left=registrations, right=logins, how='left', on='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [24]:
pd.merge(right=registrations, left=logins, how='left', on='name')

   log_id     name  reg_id
0       1   Xavier     NaN
1       2   Andrew     1.0
2       3  Yolanda     NaN
3       4     Bobo     2.0

In [25]:
pd.merge(left=registrations, right=logins, how='right', on='name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

In [35]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [36]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [41]:
pd.merge(registrations, logins, how='outer', on='name')

      name  reg_id  log_id
0   Andrew     1.0     2.0
1     Bobo     2.0     4.0
2   Claire     3.0     NaN
3    David     4.0     NaN
4   Xavier     NaN     1.0
5  Yolanda     NaN     3.0

In [44]:
registrations = registrations.set_index('name')

KeyError: "None of ['name'] are in the columns"

In [43]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [45]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [48]:
pd.merge(registrations, logins, left_index=True, right_on='name', how='inner')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [50]:
registrations = registrations.reset_index()

In [51]:
registrations.columns = [' reg_name','reg_id']

In [52]:
registrations

   reg_name  reg_id
0    Andrew       1
1      Bobo       2
2    Claire       3
3     David       4

In [53]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [55]:
results = pd.merge(registrations, logins, how='inner', left_on='reg_name', right_on='name')
results

KeyError: 'reg_name'

In [56]:
result = drop('reg_name', axis=1)

NameError: name 'drop' is not defined

In [60]:
registrations.columns = ['name', 'id']

In [61]:
logins.columns = ['id', 'name']

In [62]:
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   David   4

In [63]:
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [64]:
pd.merge(registrations, logins, how='inner', on='name')

     name  id_x  id_y
0  Andrew     1     2
1    Bobo     2     4

In [65]:
pd.merge(registrations, logins, how='inner', on='name', suffixes=['_reg','_log'])

     name  id_reg  id_log
0  Andrew       1       2
1    Bobo       2       4